Feature: Vehicles  

  Scenario: การใช้งานเมนู Vehicles
    Given เข้าที่เว็บไซต์ "http://203.154.184.66:3000/auth/signin"  
    When กรอกชื่อผู้ใช้ "new5" และรหัสผ่าน "123"  
    And กดปุ่ม "Sign in"  
    Then หน้าเว็บจะต้องเข้าสู่ระบบสำเร็จ  
    When ฉันคลิกที่เมนู "Masters"  
    And ฉันคลิกที่เมนู "Vehicles"

    Given ฉันอยู่ที่หน้าเสิร์ช
    When ฉันค้นหา "PK-10w-123"  
    And ฉันล้างการค้นหา   
    When ฉันค้นหา "New5"  
    And ฉันล้างการค้นหา    
    When ฉันค้นหา " honda "  
    And ฉันล้างการค้นหา    
    When ฉันค้นหา "HONDA"  
    And ฉันล้างการค้นหา    
    When ฉันค้นหา " CITY "  
    And ฉันล้างการค้นหา 
    When ฉันค้นหา "BMWs"  
    And ฉันล้างการค้นหา

    When ฉันกดกรองบริษัท "ภาคิน"
    When ฉันกดกรองบริษัท "ภัทรภร"
    When ฉันกดกรองบริษัท "Suppliers"
    When ฉันกดล้างค่ากรองบริษัท

    When ฉันกดกรองจำนวนล้อ "4w"
    When ฉันกดกรองจำนวนล้อ "6w"
    When ฉันกดกรองจำนวนล้อ "10w"
    When ฉันรีเซ็ตค่ากรองจำนวนล้อ

    When ฉันกดกรองสถานะ "Acitve"
    When ฉันกดกรองสถานะ "Maintenance"
    When ฉันกดกรองสถานะ "ยกเลิกใช้งาน"
    When ฉันรีเซ็ตค่ากรองสถานะ

    When ฉันกดปุ่ม Export ข้อมูล

    When ฉันเพิ่มข้อมูลยานพาหนะใหม่
    And ฉันกรอกข้อมูลในฟอร์ม
    And ฉันอัปโหลดรูปภาพและไฟล์เอกสาร
    And ฉันกรอกข้อมูลปัจจัยการขนส่ง
    And ฉันบันทึกข้อมูล
    
    When ฉันดูรายละเอียดยานพาหนะ
    And ฉันยกเลิกและยืนยันการเปลี่ยนแปลง
    And ฉันแก้ไขรายละเอียดยานพาหนะ
    And ฉันอัปโหลดรูปยานพาหนะ
    And ฉันอัปโหลดเอกสาร
    And ฉันกรอกมิติของยานพาหนะ
    And ฉันบันทึกและยืนยันการเปลี่ยนแปลง
    And ฉันลบข้อมูลยานพาหนะ